In [3]:
import pandas as pd
import numpy as np

In [13]:
np.arange(0,20).reshape(4,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [17]:
df=pd.DataFrame(data=np.arange(0,20).reshape(4,5),index=["row1","row2","row3","row4"], columns=["col1","col2","col3", "col4","col5"])

In [19]:
df.head()

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [21]:
df.tail()

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int32
 1   col2    4 non-null      int32
 2   col3    4 non-null      int32
 3   col4    4 non-null      int32
 4   col5    4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

In [25]:
#indexing in dataframes using column , index , both col and index
# 1 . By using column name
df[["col1","col2","col3","col4"]]

      col1  col2  col3  col4
row1     0     1     2     3
row2     5     6     7     8
row3    10    11    12    13
row4    15    16    17    18

In [27]:
# 2 . By using indexing
df.loc[["row1","row2","row3"]]

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14

In [29]:
# BY using both column and row index
df.iloc[2:,1:]

      col2  col3  col4  col5
row3    11    12    13    14
row4    16    17    18    19

In [33]:
#values will create an array out of it 
df.iloc[2:,1:].values

array([[11, 12, 13, 14],
       [16, 17, 18, 19]])

In [43]:
df.iloc[2:,1:].sum()

col2    27
col3    29
col4    31
col5    33
dtype: int64